<a href="https://colab.research.google.com/github/stefkong1982/netology.ru/blob/Master/%D0%91%D0%B8%D0%B1%D0%BB%D0%B8%D0%BE%D1%82%D0%B5%D0%BA%D0%B8%20Python%20%D0%B4%D0%BB%D1%8F%20%D0%B0%D0%BD%D0%B0%D0%BB%D0%B8%D0%B7%D0%B0%20%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85/%D0%9B%D0%B5%D0%BA%D1%86%D0%B8%D1%8F%20%D0%9F%D1%80%D0%BE%D0%B4%D0%B2%D0%B8%D0%BD%D1%83%D1%82%D1%8B%D0%B9%20pandas/%D0%94%D0%97_%D0%9A%D0%BE%D0%BD%D0%B4%D1%80%D0%B0%D1%82%D1%8C%D0%B5%D0%B2_NUMPY-48%20%D0%9F%D1%80%D0%BE%D0%B4%D0%B2%D0%B8%D0%BD%D1%83%D1%82%D1%8B%D0%B9%20pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Домашнее задание к лекции «Продвинутый pandas»

Преподаватель: Константин Башевой

### Задание 1
Для датафрейма log из материалов занятия создайте столбец source_type по правилам:

* если источник traffic_source равен Yandex или Google, то в source_type ставится organic;
* для источников paid и email из России ставим ad;
* для источников paid и email не из России ставим other;
* все остальные варианты берём из traffic_source без изменений.

In [1]:
import pandas as pd

Загружаем данные и изучаем

In [ ]:
table = pd.read_csv('visit_log.csv', sep=';')
table.head()

In [ ]:
table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18938 entries, 0 to 18937
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   timestamp       18938 non-null  int64
 1   visit_id        18938 non-null  object
 2   url             18938 non-null  object
 3   region          18938 non-null  object
 4   user_id         18938 non-null  object
 5   traffic_source  18938 non-null  object
dtypes: int64(1), object(5)
memory usage: 887.8+ KB

Создаем функцию для определения значения source_type

In [ ]:
def get_source_type(row):
    """
    Возвращает значение столбца 'source_type' на основе значения столбца 'traffic_source'
    и 'region' в переданной строке данных.

    Параметры:
    - row: строка данных (запись), содержащая значения столбцов 'traffic_source' и 'region'

    Возвращаемое значение:
    Значение столбца 'source_type' на основе условий:

    - Если значение столбца 'traffic_source' равно 'yandex' или 'google', возвращает 'organic'.
    - Если значение столбца 'traffic_source' равно 'paid' или 'email' и значение столбца 'region' равно 'Russia', возвращает 'ad'.
    - Если значение столбца 'traffic_source' равно 'paid' или 'email' и значение столбца 'region' не равно 'Russia', возвращает 'other'.
    - В противном случае, возвращает значение столбца 'traffic_source'.
    """
    if row['traffic_source'] in ['yandex', 'google']:
        return 'organic'
    elif row['traffic_source'] in ['paid', 'email']:
        if row['region'] == 'Russia':
            return 'ad'
        else:
            return 'other'
    else:
        return row['traffic_source']

Применяем функцию `get_source_type`

In [ ]:
table['source_type'] = table.apply(get_source_type, axis=1)
table.head()

,timestamp,visit_id,url,region,user_id,traffic_source,source_type
0,1549980692,e3b0c44298,https://host.ru/3c19b4ef7371864fa3,Russia,b1613cc09f,yandex,organic
1,1549980704,6e340b9cff,https://host.ru/c8d9213a31839f9a3a,Russia,4c3ec14bee,direct,direct
2,1549980715,96a296d224,https://host.ru/b8b58337d272ee7b15,Russia,a8c40697fb,yandex,organic
3,1549980725,709e80c884,https://host.ru/b8b58337d272ee7b15,Russia,521ac1d6a0,yandex,organic
4,1549980736,df3f619804,https://host.ru/b8b58337d272ee7b15,Russia,d7323c571c,yandex,organic

Удаляем дубликаты, чтобы наглядно посмотреть как подставились значения.

In [ ]:
unique_values = table[['traffic_source', 'source_type']].drop_duplicates()
print(unique_values)

   traffic_source source_type
0          yandex     organic
1          direct      direct
6            paid          ad
9           email          ad
11         google     organic
15           paid       other
20          email       other

Все сработало!

### Задание 2
В файле `URLs.txt` содержатся URL страниц новостного сайта. Вам нужно отфильтровать его по адресам страниц с текстами новостей. Известно, что шаблон страницы новостей имеет внутри URL конструкцию: /, затем 8 цифр, затем дефис. Выполните действия:

Прочитайте содержимое файла с датафрейм.
Отфильтруйте страницы с текстом новостей, используя метод `str.contains` и регулярное выражение в соответствие с заданным шаблоном.

In [ ]:
import pandas as pd
import re

Загружаем файл `URLs.txt` в датафрейм и читаем содержимое

In [ ]:
df = pd.read_csv('URLs.txt')
df.head()

                                                 url
0                                            /world/
1                                           /latest/
2                                      /?updated=top
3  /politics/36188461-s-marta-zhizn-rossiyan-susc...
4  /world/36007585-tramp-pridumal-kak-reshit-ukra...

In [ ]:
news_df = df[df['url'].str.contains(r"\/\d{8}-", regex=True)]
news_df.head()

                                                 url
3  /politics/36188461-s-marta-zhizn-rossiyan-susc...
4  /world/36007585-tramp-pridumal-kak-reshit-ukra...
5  /science/36157853-nasa-sobiraet-ekstrennuyu-pr...
6  /video/36001498-poyavilis-pervye-podrobnosti-g...
7  /world/36007585-tramp-pridumal-kak-reshit-ukra...

Эта строка фильтрует исходный датафрейм `df` на основе условия, заданного внутри квадратных скобок (`[ ]`), и создает новый датафрейм `news_df` с отфильтрованными данными.

Внутри скобок (`[ ]`) находится условие фильтрации:

df['url'].str.contains(r"\/\d{8}-", regex=True)


- `df['url']` обращается к столбцу 'url' в исходном датафрейме `df`.
- `.str.contains()` является методом строки, который проверяет, содержит ли каждое значение в столбце 'url' заданное регулярное выражение или подстроку.
- `r"\/\d{8}-"` - это регулярное выражение, используемое для поиска подстроки в тексте, соответствующей определенному шаблону. В данном регулярном выражении используются следующие элементы:

- `r` перед кавычками, указывает на использование "сырой" строки ("raw string"), что означает, что обратная косая черта `\` не будет интерпретироваться как специальный символ.
- `\/` - это обратная косая черта `\`, за которой следует символ `/`. Обратная косая черта используется для экранирования символа `/`, чтобы он был интерпретирован как обычный символ, а не как разделитель шаблона.
- `\d` - это специальный символ, который соответствует любой цифре от 0 до 9.
- `{8}` - это фигурные скобки, указывающие на количество повторений предыдущего элемента. В данном случае, `\d{8}` означает, что мы ожидаем точно 8 цифр.
- `-` - это символ тире, который ожидается после 8 цифр.

Совместно все вышеперечисленные элементы образуют шаблон, который ищет подстроку, состоящую из символа `/`, за которым идут точно 8 цифр, а затем символ `-`.

Примеры строк, которые могут соответствовать этому шаблону:

- `/politics/36188461-`
- `/world/36007585-`
- `/science/36157853-`
- `/video/36001498-`

- `regex=True` указывает на использование регулярных выражений при поиске.

Поэтому эта строка означает, что новый датафрейм `news_df` будет содержать только те строки из исходного датафрейма `df`, где столбец 'url' содержит подстроку, соответствующую заданному регулярному выражению.

### Задание 3
Используйте файл с оценками фильмов ml-latest-small/ratings.csv. Посчитайте среднее время жизни пользователей, которые выставили более 100 оценок. Под временем жизни понимается разница между максимальным и минимальным значениями столбца timestamp для данного значения userId.

In [ ]:
import pandas as pd

In [ ]:
ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [ ]:
user_ratings_count = ratings.groupby('userId')['rating'].count().reset_index()
user_ratings_count.head()

   userId  rating
0       1      20
1       2      76
2       3      51
3       4     204
4       5     100

Данная строка выполняет следующие действия:

1. `ratings.groupby('userId')` - группирует данные по столбцу "userId", что позволяет агрегировать данные для каждого уникального значения "userId".

2. `['rating']` - указывает, что необходимо выполнить агрегацию для столбца "rating".

3. `.count()` - вычисляет количество записей в каждой группе.

4. `.reset_index()` - сбрасывает индекс групп и преобразует результат агрегации в DataFrame.

Таким образом, `user_ratings_count` будет содержать DataFrame со столбцами "userId" и "rating", где в столбце "rating" указано количество оценок, которые каждый пользователь выставил.

In [ ]:
active_users = user_ratings_count[user_ratings_count['rating'] > 100]
active_users.head()

    userId  rating
3        4     204
7        8     116
14      15    1700
16      17     363
18      19     423

Данная строка выполняет следующие действия:

1. `user_ratings_count['rating']` - обращается к столбцу "rating" в DataFrame `user_ratings_count`, полученном на предыдущем шаге.

2. `> 100` - сравнивает каждое значение столбца "rating" с числом 100. Результатом этого сравнения будет Series с булевыми значениями (True или False), где True будет соответствовать значениям столбца "rating", которые больше 100.

In [ ]:
user_timestamps = ratings.groupby('userId')['timestamp'].agg(['min', 'max']).reset_index()
user_timestamps.head()

   userId         min         max
0       1  1260759108  1260759205
1       2   835355395   835356246
2       3  1298861589  1298932787
3       4   949778714   949982274
4       5  1163373044  1163375145

In [ ]:
active_users_timestamps = pd.merge(active_users, user_timestamps, on='userId')
active_users_timestamps.head()

   userId  rating         min         max
0       4     204   949778714   949982274
1       8     116  1154389340  1154474527
2      15    1700   997937239  1469330735
3      17     363  1127468587  1127476640
4      19     423   855190091   855195373

Данная строка выполняет следующие действия:

1. `ratings.groupby('userId')` - группирует данные по столбцу "userId", что позволяет агрегировать данные для каждого уникального значения "userId".

2. `['timestamp']` - указывает, что необходимо выполнить агрегацию для столбца "timestamp".

3. `.agg(['min', 'max'])` - применяет агрегирующую функцию для столбца "timestamp", в данном случае функции `min` и `max`. Эта операция вычисляет минимальное и максимальное значение "timestamp" для каждой группы.

4. `.reset_index()` - сбрасывает индекс групп и преобразует результат агрегации в DataFrame.

Таким образом, `user_timestamps` будет содержать DataFrame со столбцами "userId", "min" и "max", где "min" и "max" являются минимальным и максимальным значением "timestamp" для каждого пользователя. Это позволяет получить информацию о временном промежутке, в который пользователь давал оценки.

In [ ]:
active_users_timestamps = pd.merge(active_users, user_timestamps, on='userId')
active_users_timestamps.head()

   userId  rating         min         max
0       4     204   949778714   949982274
1       8     116  1154389340  1154474527
2      15    1700   997937239  1469330735
3      17     363  1127468587  1127476640
4      19     423   855190091   855195373

Данная строка выполняет следующие действия:

1. `pd.merge()` - это функция из библиотеки pandas, которая выполняет операцию объединения (join) двух DataFrame по общему столбцу или нескольким общим столбцам.

2. `active_users` - это DataFrame, содержащий информацию о активных пользователях, которые выставили более 100 оценок.

3. `user_timestamps` - это DataFrame, содержащий информацию о временных промежутках, в которые каждый пользователь выставлял оценки.

4. `on='userId'` - это параметр функции `pd.merge()`, указывающий, что объединение будет выполняться по столбцу 'userId'.

Таким образом, `active_users_timestamps` будет содержать объединенный DataFrame, который будет включать информацию об активных пользователях и их временных промежутках, в которые они выставляли оценки. Результирующий DataFrame будет иметь все столбцы из `active_users` и `user_timestamps`, и строки будут объединены на основе значения столбца 'userId'.


По умолчанию, функция `pd.merge()` выполняет левое объединение (left join). Это означает, что в результирующем DataFrame будут сохранены все строки из левого DataFrame (`active_users`), а значения столбцов из правого DataFrame (`user_timestamps`), которые соответствуют общим значениям столбца 'userId', также будут добавлены в результирующий DataFrame. Если значения столбца 'userId' отсутствуют в правом DataFrame, то соответствующие столбцы для этих значений будут заполнены пропущенными значениями (NaN).

Таким образом, результат объединения (`active_users_timestamps`) будет содержать все строки из `active_users`, а также колонки из `user_timestamps`, которые соответствуют общим значениям столбца 'userId'.

In [ ]:
active_users_timestamps['lifetime'] = active_users_timestamps['max'] - active_users_timestamps['min']
active_users_timestamps.head()

   userId  rating         min         max   lifetime
0       4     204   949778714   949982274     203560
1       8     116  1154389340  1154474527      85187
2      15    1700   997937239  1469330735  471393496
3      17     363  1127468587  1127476640       8053
4      19     423   855190091   855195373       5282

Данная строка выполняет следующие действия:


1. `active_users_timestamps['lifetime']` - создание нового столбца 'lifetime' в DataFrame `active_users_timestamps` и присвоение ему значения, полученного на предыдущем шаге.

2. `active_users_timestamps['max'] - active_users_timestamps['min']` - выполнение вычитания между значениями столбца 'max' и 'min' для каждой строки в DataFrame `active_users_timestamps`. Результатом этой операции будет новый Series, содержащий разницу между максимальным и минимальным значением 'timestamp' для каждого активного пользователя.



Таким образом, после выполнения строки, DataFrame `active_users_timestamps` будет содержать новый столбец 'lifetime', содержащий разницу между максимальным и минимальным значением 'timestamp' для каждого активного пользователя. Этот столбец может представлять время активности (в промежутках), в которых каждый активный пользователь давал оценки.

In [ ]:
average_lifetime = active_users_timestamps['lifetime'].mean()
print('Среднее время жизни пользователей:', average_lifetime)

Среднее время жизни пользователей: 40080507.4496124

`active_users_timestamps['lifetime'].mean()` - используется метод `.mean()` для подсчета среднего значения столбца 'lifetime'. Этот метод вычисляет среднее арифметическое всех значений в столбце 'lifetime'.

## Задание 4

Дана статистика услуг перевозок клиентов компании по типам:
- rzd - железнодорожные перевозки
- auto - автомобильные перевозки
- air - воздушные перевозки
- client_base - адреса клиентов

Нужно сформировать две таблицы:

таблицу с тремя типами выручки для каждого client_id без указания адреса клиента;
аналогичную таблицу по типам выручки с указанием адреса клиента.
Обратите внимание, что в процессе объединения таблиц данные не должны теряться.

Создаем новые объекты которые будут содержать статистику.

In [ ]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
rzd

   client_id  rzd_revenue
0        111         1093
1        112         2810
2        113        10283
3        114         5774
4        115          981

In [ ]:
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
auto

   client_id  auto_revenue
0        113         57483
1        114            83
2        115           912
3        116          4834
4        117            98

In [ ]:
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
air

   client_id  air_revenue
0        115           81
1        116            4
2        117           13
3        118          173

In [ ]:
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1',
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)
client_base

   client_id          address
0        111  Комсомольская 4
1        112   Энтузиастов 8а
2        113  Левобережная 1а
3        114          Мира 14
4        115        ЗЖБИиДК 1
5        116    Строителей 18
6        117  Панфиловская 33
7        118     Мастеркова 4

In [ ]:
revenue_without_address = pd.merge(rzd, auto, how='outer').merge(air, how='outer')
revenue_without_address

   client_id  rzd_revenue  auto_revenue  air_revenue
0        111       1093.0           NaN          NaN
1        112       2810.0           NaN          NaN
2        113      10283.0       57483.0          NaN
3        114       5774.0          83.0          NaN
4        115        981.0         912.0         81.0
5        116          NaN        4834.0          4.0
6        117          NaN          98.0         13.0
7        118          NaN           NaN        173.0

Данная строка кода выполняет объединение трех объектов DataFrame: `rzd`, `auto` и `air`. Результатом является новый DataFrame с названием `revenue_without_address`.

Объединение происходит с помощью метода `merge()`, который применяется дважды. В первом вызове `merge()` объединяются DataFrame `rzd` и `auto`, а во втором - объединение этого результата с DataFrame `air`.

Объединение происходит по уникальному столбцу, который присутствует в каждом из объектов DataFrame. В данном случае, такой столбец называется `client_id`.

Параметр `how='outer'` указывает, что нужно использовать внешнее (внутреннее) объединение, то есть результат будет содержать все строки из каждого объекта DataFrame, даже если у них нет соответствующих значений в других объектах DataFrame.

Результатом выполнения кода будет новый DataFrame `revenue_without_address`, который будет содержать все строки и столбцы из `rzd`, `auto` и `air`, объединенных по столбцу `client_id`, без дополнительных столбцов для адреса.

По умолчанию, метод `pd.merge()` соединяет таблицы по общим столбцам. В случае, если в обеих таблицах есть столбец с одинаковым именем, то `pd.merge()` будет использовать этот столбец для соединения данных.

In [ ]:
revenue_with_address = pd.merge(revenue_without_address, client_base, how='outer')
revenue_with_address

   client_id  rzd_revenue  auto_revenue  air_revenue          address
0        111       1093.0           NaN          NaN  Комсомольская 4
1        112       2810.0           NaN          NaN   Энтузиастов 8а
2        113      10283.0       57483.0          NaN  Левобережная 1а
3        114       5774.0          83.0          NaN          Мира 14
4        115        981.0         912.0         81.0        ЗЖБИиДК 1
5        116          NaN        4834.0          4.0    Строителей 18
6        117          NaN          98.0         13.0  Панфиловская 33
7        118          NaN           NaN        173.0     Мастеркова 4

Данная строка кода выполняет объединение объекта DataFrame `revenue_without_address` и `client_base`. Результатом будет новый DataFrame с названием `revenue_with_address`.

Объединение происходит с помощью метода `merge()`. В данном случае, объект DataFrame `revenue_without_address` объединяется с объектом DataFrame `client_base`.

Объединение происходит по уникальному столбцу, который присутствует в каждом из объектов DataFrame. В данном случае, такой столбец называется `client_id`.

Параметр `how='outer'` указывает, что нужно использовать внешнее (внутреннее) объединение, то есть результат будет содержать все строки из каждого объекта DataFrame, даже если у них нет соответствующих значений в других объектах DataFrame.

Результатом выполнения кода будет новый DataFrame `revenue_with_address`, который будет содержать все строки и столбцы из `revenue_without_address` и `client_base`, объединенные по столбцу `client_id`.